{
  "ក្រសួងមុខងារ": {
    "ថ្នាក់កណ្តាល": {
      "នាយកខុទ្ទកាល័យ": {},
      "អគ្គាធិការ នៃអគ្គាធិការដ្ឋាន": {
        "ប្រធាននាយកដ្ឋានសវនកម្មផ្ទៃក្នុង": []
      },
      "អគ្គនាយកដ្ឋានរដ្ឋបាលនិងហិរញ្ញវត្ថុ": {
        "ប្រធាននាយកដ្ឋានរដ្ឋបាល និងសរុប": [
          "ការិយាល័យកិច្ចការរដ្ឋបាល",
          "ការិយាល័យសរុប",
          "ការិយាល័យតម្កល់ឯកសារនិងបណ្ណាល័យ",
          "ការិយាល័យពិធីការនិងបដិសណ្ឋារកិច្ច"
        ],
        "ប្រធាននាយកដ្ឋានគ្រប់គ្រងបុគ្គលិក": [
          "ការិយាល័យរដ្ឋបាលនិងសរុប",
          "ការិយាល័យធនធានមនុស្ស",
          "ការិយាល័យក្របខ័ណ្ឌនិងបៀវត្ស",
          "ការិយាល័យបណ្តុះបណ្តាល"
        ],
        "ប្រធាននាយកដ្ឋានហិរញ្ញវត្ថុ និងផ្គត់ផ្គង់": [
          "ការិយាល័យរដ្ឋបាល",
          "ការិយាល័យផែនការនិងស្ថិតិ",
          "ការិយាល័យហិរញ្ញវត្ថុ",
          "ការិយាល័យគណនេយ្យនិងផ្គត់ផ្គង់"
        ],
        "ប្រធាននាយកដ្ឋានផែនការ និងស្ថិតិ": []
      },
      "អគ្គនាយកដ្ឋានគ្រប់គ្រងមុខងារសាធារណៈ": {
        "ប្រធាននាយកដ្ឋានរដ្ឋនិតិកម្ម និងវិវាទមុខងារសាធារណ": [
          "ការិយាល័យរដ្ឋបាល",
          "ការិយាល័យនិតិកម្ម",
          "ការិយាល័យផ្សព្វផ្សាយ",
          "ការិយាល័យវិវាទមុខងារសាធារណៈ"
        ],
        "ប្រធាននាយកដ្ឋានគ្រប់គ្រងក្របខណ្ខ:": [
          "ការិយាល័យធនធានមនុស្សនិងជំនាញឯកទេស",
          "ការិយាល័យក្របខ័ណ្ឌនិងវិភាគមុខងារ",
          "ការិយាល័យគ្រប់គ្រងក្របខ័ណ្ឌ មន្ត្រីជាប់កិច្ចសន្យា និងបុគ្គលិកអណ្តែត",
          "ការិយាល័យសម្របសម្រួលបណ្តុះបណ្តាល"
        ],
        "ប្រធាននាយកដ្ឋានត្រួតពិនិត្យរដ្ឋបាល និងការគ្រប់គ្រងមន្ត្រីរាជការសីុវិល": [
          "ការិយាល័យត្រួតពិនិត្យនិងផ្ទៀងផ្ទាត់សលាកបត្យព័ត៌មានមន្ត្រីរាជការសីុវិល",
          "ការិយាល័យត្រួតពិនិត្យរដ្ឋបាលនិងការគ្រប់គ្រងមន្ត្រីរាជការសីុវិល",
          "ការិយាល័យត្រួតពិនិត្យផ្លាស់ប្តូរស្ថានភាពរដ្ឋបាលនិងគ្រួសារ",
          "ការិយាល័យគ្រប់គ្រងការដំឡើងថ្នាក់និងឋានន្តរស័ក្តិ",
          "ការិយាល័យគ្រប់គ្រងការតាំងស៊ប់និងដាក់អោយចុលនិវត្តន៍ជូនមន្ត្រីរាជការសីុវិល"
        ],
        "ប្រធាននាយកដ្ឋានគ្រប់គ្រងប្រព័ន្ធព័ត៌មានវិទ្យា និងឯកសារមន្រ្តីរាជការសីុវិល": [
          "ការិយាល័យគ្រប់គ្រងនិងអភិវឌ្ឍប្រព័ន្ធព័ត៌មានវិទ្យា",
          "ការិយាល័យប្រព័ន្ធបណ្តាញនិងគាំទ្របច្ចេកទេស",
          "ការិយាល័យគ្រប់ក្រងគេហទំព័រ",
          "ការិយាល័យគ្រប់គ្រងតារាងទូទាត់បៀវត្សតាមប្រព័ន្ធព័ត៌មានវិទ្យា",
          "ការិយាល័យទិន្នន័យមន្ត្រីរាជការសីុវិលតាមប្រព័ន្ធព័ត៌មានវិទ្យា",
          "ការិយាល័យឯកសារមន្ត្រីរាជការសីុវិល"
        ],
        "ប្រធាននាយកដ្ឋានធនធានអាស៊ានកម្ពុជា និងកិច្ចសហប្រតិបត្តិការអន្តរជាតិ": [
          "ការិយាល័យទំនាក់ទំនងនិងពិធីការ",
          "ការិយាល័យអាស៊ាន",
          "ការិយាល័យសហប្រតិប្ត្តិការអន្តរជាតិ",
          "ការិយាល័យទិន្នន័យមុខងារសាធារណៈ",
          "ការិយាល័យស្រាវជ្រាវនិងនវានុវត្តន៍"
        ]
      },
      "អគ្គនាយកដ្ឋានគោលនយោបាយមុខងារសាធារណៈ": {
        "ប្រធាននាយកដ្ឋានសេវាសាធារណៈ": [
          "ការិយាល័យគោលនយោបាយសេវាសាធារណៈ",
          "ការិយាល័យព័ត៌មានសេវាសាធារណៈ",
          "ការិយាល័យសម្របសម្រួលការអនុវត្តការផ្តល់សេវាសាធារណៈ",
          "ការិយាល័យវាយតម្លៃស្តង់ដាសេវាសាធារណៈ",
          "ការិយាល័យព័ត៌មានត្រឡប់និងបណ្តឹងតវ៉ារបស់អ្នកប្រើប្រាស់សេវា"
        ],
        "ប្រធាននាយកដ្ឋានអភិវឌ្ឍន៍ធនធានមនុស្ស និងស្ថាប័ន": [
          "ការិយាល័យអភិវឌ្ឍន៍ធនធានមនុស្ស",
          "ការិយាល័យបណ្តុះបណ្តាល",
          "ការិយាល័យគ្រប់គ្រងធនធានមនុស្ស",
          "ការិយាល័យពង្រាយមន្ត្រីរាជការ",
          "ការិយាល័យពិនិត្យប្រតិបត្តិការឡើងវិញ",
          "ការិយាល័យស្រាវជ្រាវនិងអភិវឌ្ឍន៍"
        ],
        "ប្រធាននាយកដ្ឋានគោលនយោបាយលាភការ និងសមិទ្ធកម្ម": [
          "ការិយាល័យសិក្សាស្រាវជ្រាវ និងវិភាគប្រព័ន្ធលាភការ",
          "ការិយាល័យផ្សព្វផ្សាយគោលនយោលាភការនិងសមិទ្ធកម្ម",
          "ការិយាល័យសម្របសម្រួលជុំរុញអនុវត្តប្រព័ន្ធវាភការ",
          "ការិយាល័យសមិទ្ធកម្ម"
        ],
        "ប្រធាននាយកដ្ឋានសម្របសម្រួលកែទម្រង់អន្តរវិស័យ": [
          "ការិយាល័យទំនាក់ទំនងជាមួយដៃគូអភិវឌ្ឍន៍",
          "ការិយាល័យព្រឹត្តប័ត្រព័ត៌មាននិងផ្សព្វផ្សាយ",
          "ការិយាល័យគ្រប់គ្រងគម្រោងហិរញប្បទាន",
          "ការិយាល័យទំនាក់ទំនងជាមួយកំណែទម្រង់ការគ្រប់គ្រងហិរញ្ញវត្ថុសាធារណៈ",
          "ការិយាល័យទំនាក់ទំនងជាមួយកំណែទម្រង់វិមជ្ឈការនិងវិសហមជ្ឈការ"
        ],
        "ប្រធាននាយកដ្ឋានត្រួតពិនិត្យ និងវាយតម្លៃ": [
          "ការិយាល័យសិក្សាស្រាវជ្រាវ",
          "ការិយាល័យសម្របសម្រួលនិងជំរុញការអនុវត្ត",
          "ការិយាល័យត្រួតពិនិត្យនិងវេយតម្លៃការអនុវត្តគោលនយោបាយ",
          "ការិយាល័យបូកសរុបនិងវិភាគទិន្នន័យ"
        ]
      },
      "សាលាភូមិន្ទរដ្ឋបាល": {
        "ប្រធាននាយកដ្ឋានរដ្ឋបាល និហិរញ្ញវត្ថុ": [],
        "ប្រធាននាយកដ្ឋានស្រាវជ្រាវនិងទំនាក់ទំនងអន្តរជាតិ": [],
        "ប្រធាននាយកដ្ឋានបណ្តុះបណ្តាលដំបូង": [],
        "ប្រធាននាយកដ្ឋានបណ្តុះបណ្តាលបន្ត": [],
        "ប្រធាននាយកដ្ឋានសវនកម្មផ្ទៃក្នុង": [
          "ការិយាល័យសវនកម្មទី១",
          "ការិយាល័យសវនកម្មទី២",
          "ការិយាល័យសវនកម្មទី៣"
        ],
        "អគ្គាធិការ នៃអគ្គាធិការដ្ឋាន": [
          "ការិយាល័យរដ្ឋបាល",
          "ការិយាល័យអធិការកិច្ចមុខងារសាធារណៈ",
          "ការិយាល័យអធិការកិច្ចរដ្ឋបាលនិងហិរញ្ញវត្ថុ"
        ]
      }
    },
    "ថ្នាក់ក្រោមជាតិ": {
      "មន្ទីរមុខងារសាធារណៈរាជធានីខេត្ត": {}
    }
  },
  "ក្រសួងយុត្តិធម៌": {
    "ថ្នាក់កណ្តាល": {},
    "ថ្នាក់ក្រោមជាតិ": {}
  }
}
